#!/bin/env ruby
# encoding: utf-8
File.write("./hi.html",'DOCTYPE html>
<html>
<head>
	<meta charset="UTF-8">
	<title>Comptext</title>
	<link rel="stylesheet" type="text/css" href="../styles/style.css">
</head>
<body>
	<h1>%{headline}</h1>
	<a href="../en/index.html">English</a> 
	<p id="first">%question</p>
	<p id="second">%body</p>

	<ul>
		<li>Водата и земята образуват сладкия вкус.</li>
		<li>Земята и огънят - киселия вкус.</li>
		<li>Водата и огънят - соления вкус.</li>
		<li>Огънят и въздухът - лютивия вкус.</li>
		<li>Въздухът и пространството - горчивия.</li>
		<li>Въздухът и земята - стипчивия.</li>
	</ul>

	<p>Усещането на вкусовете не само влияе върху храносмилането, но има директно въздействие върху дошите. </p>
	<p>Основен принцип в Аюрведа е, че подобното увеличава подобното.</p>

	<p>Hапример сладкото, произлизащо от елементите вода и земя увеличава кафа доша, която е проявление на същите елементи, а намалява вата и питта. Сладки са храни като хлябът, оризът, млякото, захарта, повечето от плодовете. Те са необходими за всеки телесен тип, но прекомерната им употреба увеличава кафа и води до напълняване, засилване на слузната секреция в носа и околоносните синуси, образуване на храчки в бронхиалното дърво, предизвиква усещане за тежест, мързел, счита се за причина за развиване на диабет.</p>

	<p>Киселото произлиза от елементите огън и земя. Киселите храни са най-полезни за вата. Малки количества могат да се използват от кафа и съвсем малки от питта. Такива са цитрусовите плодове, киселото мляко, оцетът, сиренето, всички храни, които са продукт на ферментация. Употребявани умерено, те стимулират апетита и слюноотделянето, подобряват храносмилането, ободряват ума. При прекомерна употреба предизвикват жажда, киселини, разстройство, може да спомогнат за развитието на различни заболявания.</p>

	<p>Солените храни се използват в малки количества от всички типове, но са най-полезни за вата а увеличават питта и кафа. Солени са морската сол, каменната сол, келп. Соленото действа лаксативно, намалява спазмите в дебелото черво, подържа електролитния баланс, стимулира слюноотделянето, подобрява вкуса на храните, спомага храносмилането и отделителните процеси. Прекомерната употреба на сол може да наруши равновесието на питта и кафа. Предизвиква хипертония, влошаване на сърдечни заболявания, кожни заболявания, ранна поява на бръчки.</p> 

	<p>Лютивото е най-полезно за кафа, може да се използва в малки количества от вата и съвсем пестеливо от питта. Лютиви са много видове чушки, лук, репички, чесън, горчица, джинджифил. Те подобряват храносмилането, почистват синусите, стимулират носната и слъзната секреция. Прекомерната употреба може да доведе до усещане за парене и жажда, язва, кожни заболявания, диария, безсъние.</p>

	<p>Горчивото е полезно за всички в малки количества, но е ной-добро за питта. Горчиви са кафето, алое, куркума, марули. Горчивото подобрява вкуса на храните в комбинация с другите вкусове. Счита се за антитоксично. Изчиства тялото и черния дроб от токсини. Облекчава усещането за парене и сърбеж при кожните заболявания, намалява температурата при фебрилни състояния, подобрява храносмилането. Има изсушаващо действие и предизвиква намаляване на мазнините в тялото. Прекомерната употреба не се препоръчва. Тя е причина за суха и груба кожа, отслабване и сексуални нарушения.</p>

	<p>Стипчивото трябва да се използва в аптекарски количества. Всеки тип може да го употребява в минимални количества, но питта и кафа - малко повече от вата. Стипчиви са нарът, бобът, бамята, вишните, богатите на танини храни. Стипчивото има затягащо действие, намалява секрециите, спомага зарастването на раните и намалява кръвоизливите. Прекомерната употреба може да предизвика сухота в гърлото и устата, запек, газове, отслабване.</p>

	<p>Хората с вата конституция трябва да избягват горчиви, люти и стипчиви храни. Препоръчвани за тях са сладките, солените и киселите храни. Не са подходящи леките, сухи и студени храни. Добре е всичко да е сготвено, топло, с достатъчно мазнина, тъй като вата доша е лека, суха и постна.</p>

	<p>Хората с питта конституция трябва да избягват кисело, солено и лютиво, т.е. цитрусови плодове, туршии. Благоприятни за тях са сладки, горчиви и стипчиви храни, които трябва да не са топли и да са сготвени с умерено количество слънчогледово олио или претопено масло.</p>

	<p>Хората с кафа конституция трябва да избягват сладко, кисело и солено. Добри за тях са горчивите, лютите и стипчиви храни, които трябва да са топли, с много малко мазнина, предимно царевично или слънчогледово олио.</p>

	<p>Това са общи принципи, които не бива да се абсолютизират. Човек трябва да приема с храната си всичките шест вкуса, но в различни пропорции, съобразно своята преобладаваща доша. За да се постигне усещане за ситост е необходимо в едно хранене да присъстват всичките шест вкуса. Това разнообразие се постига, като към храната се прибавят различни подправки, а не с приемане на много продукти в едно хранене.</p>

	<h2>Тест</h2>
	<p>Довиждане</p>
</body>
</html>
')

bg_text = {
	:headline=>"Тест страница",
	:question=>"Храните подходящи за Вашия дошов тип",
	:body=>"Според Аюрведа в природата съществуват шест основни вкуса: сладко, кисело, солено, лютиво, горчиво и стипчиво. <br>Тези вкусове произлизат от петте основни елемента, от които е изградено всичко във вселената.",
}

eng_text = {
	:headline=>"Test page",
	:question=>"Foods suitable for your type doshic",
	:body=>"According to Ayurveda there are six basic tastes: sweet, sour, salty, pungent, bitter and astringent. <br> These flavors come from the five basic elements of which is made up everything in the universe.",
}